app/Models/homemodel.php

    function fetchData_book_list($search_val)
    {
        // print_r($search_val);exit;
        if($search_val != ''){
            $where_condition = '(book_author_name LIKE"%'.$search_val.'%" OR book_title LIKE "%'.$search_val.'%" OR book_isbn_number LIKE "%'.$search_val.'%" OR book_publisher_name LIKE"%'.$search_val.'%")';
            // print_r($where_condition);exit;
            return $this->db->table('boks_list')
            ->select('*')
            ->where($where_condition)
            ->where('book_is_delete', 'Active')
            ->get()
            ->getResult();
        }else{
            return $this->db->table('boks_list')
            ->select('*')
            ->where('book_is_delete', 'Active')
            ->get()
            ->getResult();
---
SELECT *
FROM `boks_list`
WHERE (book_author_name LIKE"%9%" OR `book_title` LIKE "%9%" OR `book_isbn_number` LIKE "%9%" OR book_publisher_name LIKE"%9%")
AND `book_is_delete` = 'Active'
SELECT *
FROM `boks_list`
WHERE `book_is_delete` = 'Active'